app/Controllers/Juego.php

SELECT *
FROM `Juegos`
WHERE `Juegos`.`deleted_at` IS NULL
---
        public function mostrar1(){
            $juegoModel = model('juegoModel');
            $data['juegos']=$juegoModel ->find();