app/Controllers/Resenas.php

SELECT *
FROM `resenas`
WHERE `resenas`.`deleted_at` IS NULL
---
    public function mostrar(){
        $resenaModel = model('resenaModel');
        $data['resenas']=$resenaModel ->findAll();