app/Controllers/UserController.php

    public function index()
    {
        $data['title'] = "Agregar";
        $validation = \Config\Services::validation();

        if (strtolower($this->request->getMethod()) === 'get') {
            return view('common/head') .
                view('usuario/login') .
                view('common/footer');
        }

        $rules = [
            'email' => 'required',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {
            return view('common/head') .
                view('usuario/login') .
                view('common/footer');
        } else {
            // Si pasa las reglas
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');
            $UserModel = model('UserModel');
            $data['usuario'] = $UserModel->like('email', $email)
                ->like('password', $password)
                ->findAll();
---
SELECT *
FROM `Users`
WHERE `email` LIKE '%chetosFl4@gmail.com%' ESCAPE '!'
AND  `password` LIKE '%654321%' ESCAPE '!'